application/library/Citroen/Service/MoteurConfig/_bouchons/Select.send.All.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sel="http://xml.inetpsa.com/Services/Cfg/Select" xmlns:cfg="http://inetpsa.com/cfg">
  <soapenv:Header/>
  <soapenv:Body>
    <sel:Select>

      <Select xmlns="http://inetpsa.com/cfg">
        <ContextRequest>
          <Client>CPPV2</Client>
          <Brand>C</Brand>
          <Country>FR</Country>
          <Date>2015-08-06</Date>
          <LanguageID>FR</LanguageID>
          <TaxIncluded>true</TaxIncluded>
	  <ResponseType>Versions</ResponseType>
        </ContextRequest>
        <SelectCriteria>
         	<VehicleUse></VehicleUse>
        </SelectCriteria>
      </Select>
    </sel:Select>
  </soapenv:Body>
</soapenv:Envelope>